#ifndef __DES_H__
#define __DES_H__

//检测输入格式，并转换为规定字符模式
extern int str_format(char *str, char *input);

//用于处理IP表
extern int ip_process(const char * input);

//16个16进制形式的字符转换为两个unsigned int 数。
extern int str2hex(const char *input, unsigned int *lp, unsigned int *rp);

//E变换
extern void E_exchange(const unsigned int up,char * E_output);

//F函数
extern void F_func(const unsigned int fi,const char *k,unsigned int *F_oput);

//循环移位
extern void left_shift(const int n,char *str,char *shift_buffer);

//n指定次数，产生K
extern void K_generate(const int n,const char * k_str,char * k_out);
//static void PC1_process(const char * k_str,char *k_cout,char *k_dout);
//static void PC2_process(const char *k_cbuffer,const char *k_dbuffer,char *k_out);

//反IP表，同时可以做IP变换
extern void reverse_ip_process(const unsigned int *VIP_ptr,const unsigned int input_l,const unsigned int input_r,unsigned int *VIP_loput,unsigned int *VIP_roput);

//加密
extern int des();
//解密
extern void reverse_des();

//des_encrypt_file
extern int des_encrypt_file();

/******************************部分全局变量**********************/
extern unsigned int input_l, input_r;
extern char buffer[20],input[20];           				//用于格式化
extern unsigned int IP_loput,IP_roput;      //IP的两个32位形式的输出
extern unsigned int VIP_loput,VIP_roput;
extern unsigned int rVIP_loput,rVIP_roput;
extern char IP_soput[100];									//IP的字符串形式的输出
extern unsigned char E_str[50];
extern unsigned int F_oput;
extern char key[20];
extern char *value_buffer;
extern char *output_value_buffer;

extern char des_pathname[90];
/******************************table******************************/
#if 0
const int IPtable[64]={58 ,50 ,42, 34, 26, 18, 10, 2,
										60, 52, 44, 36, 28, 20, 12, 4,
										62, 54, 46, 38, 30, 22, 14, 6,
										64 ,56 ,48 ,40 ,32 ,24 ,16, 8,
										57 ,49 ,41 ,33 ,25 ,17 ,9 , 1,
										59, 51, 43, 35, 27, 19, 11, 3,
										61, 53 ,45, 37, 29, 21, 13, 5,
										63, 55, 47, 39, 31, 23, 15, 7 };
										
const int VIPtable[64]={
										40, 8, 48, 16, 56, 24, 64, 32,
										39 ,7 ,47 ,15 ,55 ,23 ,63 ,31,
										38 ,6 ,46 ,14 ,54 ,22 ,62 ,30,
										37 ,5 ,45 ,13 ,53 ,21 ,61 ,29,
										36 ,4, 44, 12 ,52 ,20 ,60, 28,
										35 ,3 ,43 ,11 ,51 ,19 ,59 ,27,
										34 ,2, 42, 10, 50, 18 ,58, 26,
										33 ,1 ,41 ,9 ,49 ,17 ,57 ,25};

const int Etable[48]={32, 1, 2 ,3, 4, 5,

									4 ,5, 6, 7, 8, 9,
									8 ,9, 10, 11, 12 ,13,
									12 ,13 ,14 ,15 ,16 ,17,
									16 ,17, 18, 19, 20, 21,
									20 ,21 ,22 ,23 ,24 ,25,
									24 ,25 ,26 ,27 ,28 ,29,
									28 ,29 ,30 ,31, 32 ,1};
									
const int Ptable[32]={   16 ,7, 20, 21,
										29 ,12 ,28 ,17,
										1 ,15, 23 ,26,
										5 ,18 ,31 ,10,
										2 ,8, 24, 14,
										32 ,27 ,3 ,9,
										19 ,13, 30, 6,
										22 ,11 ,4 ,25};
									
const int Stable[8][4][16] = {
/*		1	 2	 3	4	5	 6	 7	8	9	10	11	12	13	14 15  16*/
	//S1
		14,  4, 13, 1 , 2 , 15, 11, 8 , 3 , 10,  6, 12,  5,  9, 0 , 7 ,
		0, 15,  7, 4 , 14,  2, 13, 1 , 10,  6, 12, 11,  9,  5, 3 , 8 ,
		4,  1, 14, 8 , 13,  6,  2, 11, 15, 12,  9 , 7 , 3, 10, 5 , 0 ,
		15, 12,  8, 2 ,  4,  9,  1,  7,  5, 11,  3, 14, 10,  0, 6 , 13,
	//S2
		15, 1, 8, 14, 6, 11, 3, 4, 9, 7, 2, 13, 12, 0, 5, 10,
		3, 13, 4, 7, 15, 2 ,8, 14, 12, 0, 1, 10, 6, 9, 11, 5,
		0, 14, 7, 11, 10, 4, 13, 1, 5, 8, 12, 6, 9, 3, 2, 15,
		13, 8, 10, 1, 3, 15, 4, 2, 11, 6, 7, 12, 0, 5, 14, 9,
	//S3
		10, 0, 9, 14, 6, 3, 15, 5, 1, 13, 12, 7, 11, 4, 2, 8,
		13, 7, 0, 9, 3, 4, 6, 10, 2, 8, 5, 14, 12, 11, 15, 1,
		13, 6, 4, 9, 8, 15, 3, 0, 11, 1, 2, 12, 5, 10, 14, 7,
		1, 10, 13, 0, 6, 9, 8, 7, 4, 15, 14, 3, 11, 5, 2, 12,
	//S4
		7, 13, 14, 3, 0, 6, 9, 10, 1, 2, 8, 5, 11, 12, 4, 15,
		13, 8, 11, 5, 6, 15, 0, 3, 4, 7, 2, 12, 1, 10, 14, 9,
		10, 6, 9, 0, 12, 11, 7, 13, 15, 1, 3, 14, 5, 2, 8, 4,
		3, 15, 0, 6, 10, 1, 13, 8, 9, 4, 5, 11, 12, 7, 2, 14,
	//S5
		2, 12, 4, 1, 7, 10, 11, 6, 8, 5, 3, 15, 13, 0, 14, 9,
		14, 11, 2, 12, 4, 7, 13, 1, 5, 0, 15, 10, 3, 9, 8, 6,
		4, 2, 1, 11, 10, 13, 7, 8, 15, 9, 12, 5, 6, 3, 0, 14,
		11, 8, 12, 7, 1, 14, 2, 13, 6, 15, 0, 9, 10, 4, 5, 3,
	//S6
		12, 1, 10, 15, 9, 2, 6, 8, 0, 13, 3, 4, 14, 7, 5, 11,
		10, 15, 4, 2, 7, 12, 9, 5, 6, 1, 13, 14, 0, 11, 3, 8,
		9, 14, 15, 5, 2, 8, 12, 3, 7, 0, 4, 10, 1, 13, 11, 6,
		4, 3, 2, 12, 9, 5, 15, 10, 11, 14, 1, 7, 6, 0, 8, 13,
	//S7
		4, 11, 2, 14, 15, 0, 8, 13, 3, 12, 9, 7, 5, 10, 6, 1,
		13, 0, 11, 7, 4, 9, 1, 10, 14, 3, 5, 12, 2, 15, 8, 6,
		1, 4, 11, 13, 12, 3, 7, 14, 10, 15, 6, 8, 0, 5, 9, 2,
		6, 11, 13, 8, 1, 4, 10, 7, 9, 5, 0, 15, 14, 2, 3, 12,
	//S8
		13, 2, 8, 4, 6, 15, 11, 1, 10, 9, 3, 14, 5, 0, 12, 7,
		1, 15, 13, 8, 10, 3, 7, 4, 12, 5, 6, 11, 0, 14, 9, 2,
		7, 11, 4, 1, 9, 12, 14, 2, 0, 6, 10, 13, 15, 3, 5, 8,
		2, 1, 14, 7, 4, 10, 8, 13, 15, 12, 9, 0, 3, 5, 6, 11
};

const int PC1table[56]={
						57 ,49 ,41 ,33 ,25 ,17, 9,
						1 ,58 ,50 ,42 ,34 ,26, 18,
						10 ,2 ,59, 51 ,43 ,35 ,27,
						19 ,11 ,3, 60, 52 ,44 ,36,
						63, 55, 47, 39 ,31 ,23 ,15,
						7 ,62,54 ,46 ,38, 30, 22,
						14 ,6 ,61 ,53 ,45, 37 ,29,
						21 ,13 ,5 ,28 ,20 ,12 ,4};
												
const int PC2table[48]={
						14, 17 ,11, 24, 1,5,
						3 ,28, 15, 6 ,21 ,10,
						23, 19, 12, 4, 26, 8,
						16, 7, 27, 20, 13, 2,
						41, 52, 31, 37, 47, 55,
						30 ,40 ,51 ,45, 33 ,48,
						44 ,49, 39, 56, 34, 53,
						46 ,42 ,50 ,36 ,29 ,32};
												
const int LStable[16]={1,1,2,2,2,2,2,2,1,2,2,2,2,2,2,1};
#endif
#endif























